# Задание 1
# Напишите программу, которая принимает на вход число от 1 до 7 и выводит соответствующий
# день недели (например, 1 - понедельник, 2 - вторник и т.д.).

# day = int(input('Введите число 1-7: '))
# if day == 1:
#     print(f"{day} - Понедельник")
# elif day == 2:
#     print(f'{day} - Вторник')
#
# elif day == 3:
#     print(f"{day} - Среда")
# elif day == 4:
#     print(f"{day} - Четверг")
# elif day == 5:
#     print(f"{day} - Пятница")
# elif day == 6:
#     print(f"{day} - Суббота")
# elif day == 7:
#     print(f"{day} - Воскресенье")
# else:
#     print('Неправильный ввод')



day_number = int(input('Введите число 1-7: '))
days_of_week = {
    1: "Понедельник",
    2: "Вторник",
    3: "Среда",
    4: "Четверг",
    5: "Пятница",
    6: "Суббота",
    7: "Воскресенье"
}
if 1 <= day_number <=7:
    print(days_of_week[day_number])
else:
    print("Некорректный ввод. ВВедите значение от 1 до 7")
