'''
Задача: Напишите программу, которая находит сумму всех элементов списка.
'''

list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
sum = 0
for i in list:
    sum += i
print(sum)